{
    "1": "What is the main assumption behind multiple linear regression?",
    "2": "How is the loss function in multiple linear regression defined?",
    "3": "When should multiple linear regression be avoided?",
    "4": "How do you interpret the coefficients of a linear regression model?",
    "5": "Why would you use polynomial regression over linear regression?",
    "6": "What is the danger of using high-degree polynomials?",
    "7": "How do splines improve over high-degree polynomials?",
    "8": "What is the purpose of regularization?",
    "9": "How does Ridge differ from Lasso regression?",
    "10": "Which regularization technique can be used for feature selection?",
    "11": "What does the alpha hyperparameter control in Ridge and Lasso?",
    "12": "What type of problem does logistic regression solve?",
    "13": "What is the output of a logistic regression model?",
    "14": "How does F1-score help when dealing with imbalanced datasets?",
    "15": "Explain a scenario in which recall is more important than precision and why.",
    "17": "What kind of data are CNNs best suited for?",
    "18": "Name two common layers used in CNNs.",
    "19": "Name parameters used for defining a CNN.",
    "20": "What is the role of filters in CNNs?",
    "21": "What makes RNNs different from feedforward networks?",
    "22": "What is a limitation of typical RNNs?",
    "23": "What data types are RNNs commonly used for?",
    "24": "Name 3 examples of sequential problems?",
    "25": "What is the core idea behind ensemble methods?",
    "26": "What are the main types of ensemble methods?",
    "27": "What is stacking in ensemble learning?",
    "28": "What are the advantages of using ensemble models?",
    "29": "How does a random forest differ from a decision tree?",
    "30": "What is the role of max_features in Random Forest?",
    "31": "What is an out of bag sample?",
    "32": "What does increasing n_estimators typically do?",
    "33": "How does boosting work conceptually?",
    "34": "What is the impact of learners on the final prediction in AdaBoost?",
    "35": "What is the role of learning_rate in boosting?",
    "36": "Why is boosting more prone to overfitting than bagging?",
    "37": "What kind of clustering does DBSCAN perform?",
    "38": "What does the eps parameter control in DBSCAN?",
    "39": "How does DBSCAN handle outliers?",
    "40": "What type of datasets is DBSCAN ideal for?",
    "41": "What is the primary purpose of UMAP?",
    "42": "What does n_neighbors control in UMAP?",
    "43": "What is a common application of UMAP?",
    "44": "Is UMAP deterministic?",
    "45": "What is the main idea of MDS?",
    "46": "What is the difference between metric and non-metric MDS?",
    "47": "Give an example of when is recommended to use metric MDS.",
    "48": "How is the computational speed of MDS when compared to UMAP or t-SNE?",
    "49": "What does the SVM algorithm aim to maximize?",
    "50": "What is a support vector?",
    "51": "What does the kernel trick allow in SVMs?",
    "52": "What does the hyperparameter C control?"
  }
  